ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_mindb_lut_regs.xml
<module id="MINDB_LUT_REGS" HW_revision="" description="MINDB LUT Registers">
	<register id="MINDBCFG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Minimum dead band configuration register.">
		<bitfield id="ENABLEA" description="Minimum dead band logic enable on PWMA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INVERTA" description="Invert the selected reference signal on PWMA" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SELBLOCKA" description="BLOCK signal source select on PWMA" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SELA" description="Reference source select on PWMA min dead band logic." begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="POLSELA" description="Select signal for the AND OR logic of PWMA " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ENABLEB" description="Minimum dead band logic enable on PWMB" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="INVERTB" description="Invert the selected reference signal on PWMB" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SELBLOCKB" description="BLOCK signal source select on PWMB" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SELB" description="Reference source select on PWMB min dead band logic." begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="POLSELB" description="Select signal for the AND OR logic of PWMB" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="MINDBDLY" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Minimum dead band delay register">
		<bitfield id="DELAYA" description="Minimum dead band delay on PWMA" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="DELAYB" description="Minimum dead band delay on PWMB" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="LUTCTLA" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="LUT control register on PWMA">
		<bitfield id="BYPASS" description="Bypass LUTA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SELXBAR" description="ICSS XBAR select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="LUTDEC0" description="LUT output PWMA value on decoding 0" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC1" description="LUT output PWMA value on decoding 1" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC2" description="LUT output PWMA value on decoding 2" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC3" description="LUT output PWMA value on decoding 3" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC4" description="LUT output PWMA value on decoding 4" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC5" description="LUT output PWMA value on decoding 5" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC6" description="LUT output PWMA value on decoding 6" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC7" description="LUT output PWMA value on decoding 7" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="LUTCTLB" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="LUT control register on PWMB">
		<bitfield id="BYPASS" description="Bypass LUTB" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SELXBAR" description="ICSS XBAR select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="LUTDEC0" description="LUT output PWMB value on decoding 0" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC1" description="LUT output PWMB value on decoding 1" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC2" description="LUT output PWMB value on decoding 2" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC3" description="LUT output PWMB value on decoding 3" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC4" description="LUT output PWMB value on decoding 4" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC5" description="LUT output PWMB value on decoding 5" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC6" description="LUT output PWMB value on decoding 6" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="LUTDEC7" description="LUT output PWMB value on decoding 7" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
</module>
